Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ИнвойсПродажи</xr:Item>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document._ВозвратОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТовара</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКонсигнации</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрПроцент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>счеКонсигнация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУслуг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВозвратов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСЗатратами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкуРазрешил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентМинус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>стрПроцент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>счКонсигнация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУслуг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозврата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ПриходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПриходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидДвиженияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидДвиженияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвестиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Биржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логистика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходнаяНакладная/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = "РасходнаяНакладная";
	//Документы[ИмяДокумента].ЗаполнитьРеквизиты(ЭтаФорма);
	гоФормаСпискаПриСоздании(ЭтаФорма);
	
	//2015.11.24
	глПокраситьВалюты(ЭтаФорма, "Валюта");
	глПокраситьСостояние(ЭтаФорма, ИмяДокумента); 
	глУстановитьГраницуВидимости(Список);
	// © Primus1C  17.10.2023  НАЧАЛО ►
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	//Элементы.ФормаСлужба.Видимость = гоАдминистратор();
	
	//2015.12.08
	//Элементы.стрПроцент.Видимость = ВКД_ПроверитьДоступностьРоли();   
	Режим = ОбщегоНазначенияПовтИсп.ВидимостьНаценки();
	Элементы.стрПроцент.Видимость = Режим;
	Элементы.ПроцентПлюс.Видимость = Режим;
	Элементы.ПроцентМинус.Видимость = Режим или РольДоступна("Менеджер");
	
	//РежимК = ОбщегоНазначенияПовтИсп.ДоступныНаименованияКонтрагентов();
	//Если НЕ РежимК Тогда
	//	Элементы.Покупатель.Видимость = Ложь;
	//КонецЕсли;
	
	//2017.03.24
	//Мас = омСервер.МассивСкладов();
	//Если Мас.Количество() <> 0 Тогда гоСтандартныйОтбор(Список, 1, Истина, Мас) КонецЕсли;
	
	//ВКД++
	//Список.Параметры.УстановитьЗначениеПараметра("КемСоздан",ПараметрыСеанса.Пользователь);
	//ВКД--
	
	// © Primus1C  03.12.2023  НАЧАЛО ►
	////МасК = омСервер.МассивКонтрагентов();
	////Если МасК.Количество() > 0 Тогда гоСтандартныйОтбор(Список, 1, Истина, МасК) КонецЕсли;   
	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	гоСтандартныйОтборПоПолю("Склады", 		Список, "Склад");

	ФорматВремени = Истина;   
	
	СтруктураПечатныхФорм = Документы.РасходнаяНакладная.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Ложь, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаСервере
Процедура УстановитьВсеПараметры()
	Документы[ИмяДокумента].УстановитьВсеПараметры(ЭтаФорма);
	УстановитьФирму();
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	//МожноВКассу = гоКолинко() ИЛИ гоЕстьРоль("ОплатыПоставщикам");
	//Элементы.ВКассу.Видимость = МожноВКассу;
	//Элементы.ВКассу.Доступность = МожноВКассу;
КонецПроцедуры

&НаСервере
Процедура УстановитьФирму(Принудительно = 0)
	Фильтр = гоФирма();
	Если НЕ (Принудительно = 0) Тогда Фильтр = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 0, Истина, Фильтр);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);
	УстановитьВсеПараметры();
	гоЖурналПриОткрытии(ЭтаФорма, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	гоЖурналПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	//СтандартнаяОбработка = гоАдминистратор();

КонецПроцедуры

&НаКлиенте
Процедура Служба(Команда)
	СлужбаСервер();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СлужбаСервер()
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ПолучитьРекв(Стр, ТекКли, ТекВал, ТекОко, ТекПрв, ТекСум, ТекМаг, ТекДокСчет)
	ТекКли = Стр.Контрагент;
	ТекВал = Стр.Валюта;
	ТекОко = Стр.Окончательно;
	ТекПрв = Стр.Проведен;
	ТекСум = омСервер.Долг(Стр, "ДолгПокупателя");
	ТекМаг = Стр.Фирма;
	Попытка
		ТекДокСчет = Стр.ДокСчет;
	Исключение
		ТекДокСчет = 0;
	КонецПопытки; 
КонецПроцедуры 

&НаКлиенте
Процедура ВКассу(Команда)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список;
	ВыдСтроки = Элементы.Список.ВыделенныеСтроки;
	
	ТекКли = 0;
	ТекВал = 0;
	ТекОко = 0;
	ТекПрв = 0;
	ТекСум = 0;
	ТекМаг = 0;
	ТекДокСчет = 0;
	
	СохКли = 0;
	СохВал = 0;
	СохМаг = 0;
	СохДокСчет = 0;
	
	Сум = 0;
	Спи = Новый СписокЗначений;
	
	Для Каждого Стр Из ВыдСтроки Цикл
		ПолучитьРекв(Стр, ТекКли, ТекВал, ТекОко, ТекПрв, ТекСум, ТекМаг, ТекДокСчет);
		Если ТекСум = 0 Тогда Продолжить КонецЕсли;
		Если НЕ ТекПрв Тогда Продолжить КонецЕсли; 
		Если НЕ ТекОко Тогда Продолжить КонецЕсли; 
		Если гоПЗ(ТекКли) Тогда Продолжить КонецЕсли; 
		Если гоПЗ(ТекВал) Тогда Продолжить КонецЕсли; 
		Если гоПЗ(ТекМаг) Тогда Продолжить КонецЕсли; 
		
		Если СохВал = 0 Тогда СохВал = ТекВал КонецЕсли; 
		Если СохКли = 0 Тогда СохКли = ТекКли КонецЕсли; 
		Если СохМаг = 0 Тогда СохМаг = ТекМаг КонецЕсли; 
		Если СохДокСчет = 0 Тогда СохДокСчет = ТекДокСчет КонецЕсли; 
		
		Если ТекКли <> СохКли Тогда Продолжить КонецЕсли; 
		Если ТекВал <> СохВал Тогда Продолжить КонецЕсли; 
		Если ТекМаг <> СохМаг Тогда Продолжить КонецЕсли; 
		Если ТекДокСчет <> СохДокСчет Тогда Продолжить КонецЕсли;
		
		гоПлюс(Сум, ТекСум);
		
		Спи.Добавить(Стр);
	КонецЦикла; 
	
	Если Спи.Количество() = 0 Тогда клОшибка(НСтр("ru = 'Нет документов с долгами среди выделенных!'; en = 'There are no documents with debts among the selected ones!'")); Возврат; КонецЕсли; 	// (в пределах первого счета)
	
	Пар = Новый Структура;
	
	Пар.Вставить("Фирма", СохМаг);
	Пар.Вставить("Валюта", СохВал);
	Пар.Вставить("Контрагент", СохКли);
	Пар.Вставить("Накладных", Спи.Количество());
	Пар.Вставить("Сумма", Сум);
	ОткрытьФорму("ОбщаяФорма.ВводОплаты", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ВКассуПослеВводаОплаты", ЭтотОбъект, Новый Структура("СохМаг,СохКли,СохВал,Сум,Спи,СохДокСчет", СохМаг, СохКли, СохВал, Сум, Спи, СохДокСчет)));
КонецПроцедуры

&НаКлиенте
Процедура ВКассуПослеВводаОплаты(Рез, Параметры) Экспорт
	Если Рез = Неопределено Тогда Возврат КонецЕсли;
	
	СохМаг = Параметры.СохМаг;
	СохКли = Параметры.СохКли;
	СохВал = Параметры.СохВал;
	Сум = Параметры.Сум;
	Спи = Параметры.Спи;
	СохДокСчет = Параметры.СохДокСчет;
	
	Опл = Рез.Оплата;
	ДСЧ = Рез.ДСчет;
	Бум = Мин(Сум, Опл);
	При = ?(Бум >= Опл, "", "Сдача: " + гоСуммаВал2(Опл - Бум, СохВал));
	
	клНетДа(Новый ОписаниеОповещения("ВКассуПослеПодтверждения", ЭтотОбъект, Новый Структура("СохМаг,СохКли,СохВал,ДСЧ,Бум,Сум,Спи,При,СохДокСчет", СохМаг, СохКли, СохВал, ДСЧ, Бум, Сум, Спи, При, СохДокСчет)),
		"Внести в " + гоИмя(ДСЧ) + " сумму: " + гоСуммаВал2(Бум, СохВал) + " и привязать к выделенным документам (" + Спи.Количество() +")?");
КонецПроцедуры

&НаКлиенте
Процедура ВКассуПослеПодтверждения(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	СохМаг = Параметры.СохМаг;
	СохКли = Параметры.СохКли;
	СохВал = Параметры.СохВал;
	ДСЧ = Параметры.ДСЧ;
	Бум = Параметры.Бум;
	Сум = Параметры.Сум;
	Спи = Параметры.Спи;
	При = Параметры.При;
	СохДокСчет = Параметры.СохДокСчет;
	
	Если Бум < Сум Тогда  
		клНетДа(Новый ОписаниеОповещения("ВКассуЗавершение", ЭтотОбъект, Новый Структура("СохМаг,СохКли,СохВал,ДСЧ,Бум,Спи,При,СохДокСчет", СохМаг, СохКли, СохВал, ДСЧ, Бум, Спи, При, СохДокСчет)),
			"Для полной оплаты не хватает суммы: " + гоСуммаВал2(Сум - Бум, СохВал) + " (документы будут оплачены частично)! ПРОДОЛЖАТЬ?", , Истина);
		Возврат;
	КонецЕсли;
	
	ВКассуЗавершение(Истина, Новый Структура("СохМаг,СохКли,СохВал,ДСЧ,Бум,Спи,При,СохДокСчет", СохМаг, СохКли, СохВал, ДСЧ, Бум, Спи, При, СохДокСчет));
КонецПроцедуры

&НаКлиенте
Процедура ВКассуЗавершение(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	СохМаг = Параметры.СохМаг;
	СохКли = Параметры.СохКли;
	СохВал = Параметры.СохВал;
	ДСЧ = Параметры.ДСЧ;
	Бум = Параметры.Бум;
	Спи = Параметры.Спи;
	При = Параметры.При;
	СохДокСчет = Параметры.СохДокСчет;
	
	//все на все согласны, можно вызывать серверную процедуру привязки списка документов
	РезСоо = "";
	СоздатьОплату(СохМаг, СохКли, СохВал, ДСЧ, Бум, Спи, При, СохДокСчет, РезСоо);
	клЕстьОшибка(РезСоо);
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьОплату(ТекМаг, ТекКли, ТекВал, ТекСче, Сум, Спи, При, ТекДокСчет, РезСоо)
    Док = Документы.ДвижениеДенег.СоздатьДокумент();
	
	Док.Дата = ТекущаяДата();
	Док.Фирма = ТекМаг;
	Док.Валюта = ТекВал;
	Док.Контрагент = ТекКли;
	Док.Сумма = Сум;
	Док.ДСчет = ТекСче;
	Док.Примечание = При;
	Док.ПриходРасход = Перечисления.ПриходРасход.Приход;
	Док.ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Покупатели;
	Док.Окончательно = Истина;
	
	//пока нету такого
	//Док.ДокСчет = ТекДокСчет;
	
	Есть = Сум;
	
	Для Каждого Эле Из Спи Цикл
		Тек = Эле.Значение;
		Дол = омСервер.Долг(Тек, "ДолгПокупателя");
		Если Дол <= 0 Тогда Продолжить КонецЕсли; 
		
		Если Дол < Есть Тогда 
			Берем = Дол;
		Иначе 
			Берем = Есть;
		КонецЕсли; 
		гоМинус(Есть, Берем);
		
		Стр = Док.Привязки.Добавить();
		Стр.Сумма1 = Берем;
		Стр.Валюта1 = ТекВал;
		Стр.КроссКурс = 1;
		Стр.Сумма2 = Берем;
		Стр.Валюта2 = ТекВал;
		Стр.Док2 = Тек;
		
		Если Есть = 0 Тогда Прервать КонецЕсли;
	КонецЦикла; 
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	    гоРезСоо(РезСоо, гоИмя(Док.Ссылка) + ": " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// © Primus1C  31.12.2024  НАЧАЛО ►

&НаКлиенте
Процедура ДатаВремяПриИзменении(Элемент)

	Элементы.Список.ПодчиненныеЭлементы.Дата.Формат = ?(ФорматВремени, "ДФ=dd.MM.yyyy", "ДФ='dd.MM.yyyy HH:mm:ss'");
    Элементы.Список.Обновить();
	
КонецПроцедуры


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(ТекущийЭлемент.ТекущаяСтрока, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.РасходнаяНакладная.ПечатьДокумента(ТекущийЭлемент.ТекущаяСтрока, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти 

// © Primus1C  ОКОНЧАНИЕ ◄
